{
  "friday": {
    "timeSlots": [
      {
        "id": 0,
        "name": "Registration",
        "startTime": "8:00AM",
        "endTime": "9:00AM",
        "duration": 60
      },
      {
        "id": 1,
        "name": "Keynote",
        "startTime": "9:00AM",
        "endTime": "10:30AM",
        "duration": 90
      },
      {
        "id": 2,
        "name": "Break",
        "startTime": "10:30AM",
        "endTime": "11:15AM",
        "duration": 45
      },
      {
        "id": 3,
        "name": "Workshop A",
        "startTime": "11:15AM",
        "endTime": "12:15PM",
        "duration": 60
      },
      {
        "id": 4,
        "name": "Lunch",
        "startTime": "12:15PM",
        "endTime": "1:45PM",
        "duration": 90
      },
      {
        "id": 5,
        "name": "Workshop B",
        "startTime": "1:45PM",
        "endTime": "2:45PM",
        "duration": 60
      },
      {
        "id": 6,
        "name": "Break",
        "startTime": "2:45PM",
        "endTime": "3:30PM",
        "duration": 45
      },
      {
        "id": 7,
        "name": "Keynote",
        "startTime": "3:30PM",
        "endTime": "4:30PM",
        "duration": 60
      },
      {
        "id": 8,
        "name": "Dinner",
        "startTime": "4:30PM",
        "endTime": "6:30PM",
        "duration": 120
      },
      {
        "id": 9,
        "name": "Family Night -FREE- Invite Your Friends!",
        "startTime": "6:30PM",
        "endTime": "8:30PM",
        "duration": 120
      }
    ],
    "activities": {
      "0": [
        {
          "name": "Registration",
          "location": "Registration Table",
          "speaker": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        }
      ],
      "1": [
        {
          "name":
            "How to Raise Up Generations to Defend the Christian Faith in an Increasingly Hostile Culture",
          "location": "Worship Center",
          "speaker": "Ken Ham",
          "image":
            "https://www.christianheritageonline.org/wp-content/uploads/2016/12/Ham_Ken_lg.png",
          "description":
            "About two-thirds of young people leave church by college age-with few returning. Ken looks at new statistical research published in Ready to Return, to show that the millennial generation is more secular in worldview than ever. Millennials who currently attend church are its future voice. A strong stand on biblical authority is needed (rooting out compromise and teaching apologetics) to reclaim lost and coming generations for Christ."
        }
      ],
      "2": [
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null,
          "description": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null,
          "description": null
        }
      ],
      "3": [
        {
          "name":
            "What Happened to the Church in America? Why Is the Church Not Impacting the Culture as It Used To?",
          "location": "Worship Center",
          "speaker": "Ken Ham",
          "description":
            "Find out how Genesis 1-11 is foundational to developing a truly Christian worldview. As Ken walks you through the 7 C’s of history, you will see how all the Christian doctrines essential for a truly biblical worldview are founded in the geology, biology, astronomy, and anthropology that is recorded in Genesis."
        },
        {
          "name": "Unleashing Men & Fathers of the Word",
          "location": "Gym",
          "speaker": "Dr. Carlton McLeod",
          "description":
            "No one said fatherhood would be easy! It’s challenging to be a godly father with the desire to see his children walk in his footsteps. Dr. McLeod encourages fathers and teaches us what our Lord says of fathers."
        },
        {
          "name": "What if I Ruin My Child?",
          "location": "Chapel",
          "speaker": "Connie Albers",
          "description":
            "Have you wondered if homeschooling would ruin your child? If you answered yes, then take comfort; you are not alone. We all struggle at some point. After all, homeschooling is “on the job” training. When Connie started homeschooling twenty-five years ago, that is what she thought as well. Parents, come learn truths from a mom who knows you are not ruining your child."
        },
        {
          "name":
            "When More Is Less: A Call to Simplicity in Your Schedule, Your Home, and Your Children's Education",
          "location": "Red 7&8",
          "speaker": "Sonya Shafer",
          "description":
            "It’s easy to get caught up in the mentality that we’ve got to add more: we must do more, we must get more, and our children must study more. More, more, more! But the funny thing is that when we keep adding more, we usually end up with less of what really matters. Come discover the richness that simplicity can bring to your schedule, your home, and your children’s education."
        },
        {
          "name": "Why a Home Based Business?",
          "location": "Student Room",
          "speaker": "Allen Blain",
          "description":
            "Do you want to learn about benefits of operating a home business? Advantages include bringing fathers and mothers home full-time, having a part-time project, creating a second income, and providing financial relief.  Allan shares a biblical foundation for ways to create stronger family bonds and provide financial and time freedom to “do life” as a family and serve others in purposeful and impactful ways."
        },
        {
          "name": "College Madness - When the Crowd is Wrong",
          "location": "Third Floor Lobby",
          "speaker": "Jonathan Brush",
          "description":
            "Many say, \"Go to school, get good grades, and go to a good college so you can get a good job and live The American Dream!\" Join Jonathan to learn about crowd dynamics, group think, and how to make sure you understand the incredible changes, opportunities, and challenges happening in higher education today… regardless of what the crowd is doing."
        },
        {
          "name": "Modern History That Shook the World!",
          "location": "Lobby Room North",
          "speaker": "Linda Hobar",
          "description":
            "Want to understand today’s headlines? Planning to teach modern history? Then join Linda to recount world-shaking events from the 20th century to present day, with a biblical worldview. Vivid snapshots of the Cold War, formation of Israel, war in Korea, collapse of the Soviet Union, and more,reveal the past so students and teachers can understand clearly and better prepare for the future!"
        },
        {
          "name": "Building Godly Character with Older Books",
          "location": "Lobby Room South",
          "speaker": "Dennis Gundersen",
          "description":
            "Homeschool families often say, “Older books are SO much better!” Is that true? Find out why Christian books from the 18th and 19th centuries were unique—richer in content and more prone to form godly character. Learn how you can best use literature from that era to strengthen Christian character in your children."
        },
        {
          "name": "Has Radiometric Dating Poinsoned Your Faith?",
          "location": "Green 7",
          "speaker": "Patrick Nurre",
          "description":
            "Is radiometric dating as scientific as secular geologists say it is? The church is fast buckling under the supposed weight of radiometric dating evidence for an old earth. What is the truth of the matter?"
        },
        {
          "name": "Managing the Homeschool from the Sick Bed",
          "location": "Red 9",
          "speaker": "Julianne Primer",
          "description":
            "As a cancer survivor and endurer of Lyme Disease, Julianne shares practical tips and encouragement that will keep a home and homeschool running smoothly during a mom’s extended illness."
        },
        {
          "name": "\"HLEP!\" My Kid Can't Spell!",
          "location": "Red 5",
          "speaker": "Faith Berens",
          "description":
            "Find out why spelling is so important in a child’s education. Faith shares various strategies, techniques,and fun, hands-on, multi-sensory methods you can use for spelling practice. The goal is to transform “I am aterrible speller” into “I am a good speller!”"
        },
        {
          "name": "The Supernatural Invasion of Our Homes",
          "location": "Green 4",
          "speaker": "Eric Barger",
          "description":
            "Eric Barger exposes how the supernatural world is invading our homes, while neutralizing the fears that many have about this mysterious topic."
        },
        {
          "name": "Christian Heritage Chorale Session #1",
          "location": "Chorale Room",
          "speaker": "Neil Craig",
          "description": ""
        }
      ],
      "4": [
        {
          "name": "Concessions",
          "location": null,
          "speaker": null,
          "description":
            "K.C Deez BBQ - Front Driveway \nWich Came First - Front Driveway \nSugar & Spice - Front Driveway \nCH Healthy Eats & Treats - Fellowship Park"
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null,
          "description": null
        },
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null,
          "description": null
        },
        {
          "name": "Vendor Workshop: The Last \"Free\" Generation?",
          "location": "Chapel",
          "speaker": "Dave Stockton",
          "description":
            "Ronald Reagan said, “Freedom is never more than one generation away from extinction. We didn't pass it to our children in the bloodstream. It must be fought for, protected, and handed on for them to do the same.” Will our kids be part of the final “free” generation? Our freedoms are eroding today at a rapid rate, but is there a way to slow down or stop the erosion? Let’s discuss how we, as Christians, can make a difference today."
        },
        {
          "name": "Vendor Workshop: Taking Advantage of the Single Life",
          "location": "Red 7&8",
          "speaker": "Esther Roth",
          "description":
            "Perhaps you grew up expecting to be married and raising a family by now. Or perhaps you have particular skills/training and want to use them in some way but don't know where to start. What does God want for you?  What kind of opportunities are out there? Hear practical ways to use your time, skills, and talents while still single."
        },
        {
          "name": "Vendor Workshop: Using Opportunities to Evangelize",
          "location": "Student Room",
          "speaker": "John Smythe",
          "description":
            "Jesus’ last command is \"Go ye therefore, and teach all nations...\" (Matthew 28:19a) Obedience to this command is easier than you think! If you want to have a great way to meet people and effect changes in lives for eternity, this roundtable discussion is for you."
        },
        {
          "name": "Vendor Workshop: Math is More than Just Numbers with RightStart Math",
          "location": "Lobby Room North",
          "speaker": "RightSmart Mathmatics",
          "description":
            "Math is more than just numbers with RightStart™ Math. Poetry is beautiful because it has rhyme, reason, and pattern. Poetry paints a picture. It is so much more than letters, just as math is so much more than numbers. RightStart™ Math becomes poetry when it’s explored and understood. Do you see the patterns in math? Does math paint a picture? If you said no to these questions, you need to come and discover the beauty of math."
        },
        {
          "name":
            "Vendor Workshop: Making the Cut: A Homeschool Family's Journey into Full-time Filmmaking",
          "location": "Lobby Room South",
          "speaker": "Little Crew Studios",
          "description":
            "One family’s story of leaving the security of a regular paycheck for the uncertainty of a family business in order to make Dad a more integral part of homeschool family life. Joel Steege, director/producer of The Runner from Ravenshead and The Defense of New Haven, discusses the rewarding but challenging journey into making movies as a family, as well as mistakes and lessons learned along the way. (Bonus: a few behind-the-scenes clips from Little Crew Studios’ productions!)"
        },
        {
          "name": "Vendor Workshop: And Which Children Don't Need Communication Skills?",
          "location": "Red 5",
          "speaker": "NCFCA, Homeschool Speech and Debate",
          "description":
            "Explore how competitive speech and debate can give our children the confidence to engage culture without being intimidated. Would you like them to learn and practice critical thinking, research, logic and rhetoric all in one activity? Speech activities start for 12-13 year olds and debate starts in high school. Hear both parent and student perspectives."
        },
        {
          "name": "Vendor Workshop: Principles for Living Life With Passion, Purpose, and Victory",
          "location": "Green 4",
          "speaker": "Cheryl's Christian Books",
          "description":
            "We are faced with daily challenges, biblical standards are being compromised, our culture adheres to having no absolute truths, and spiritually, we are at war between good and evil. This message sheds light on seven specific principles to experience the abundant life Jesus wants for His children - a life lived with passion, purpose, and victory! As parents, homeschoolers, and educators, we are not only to integrate biblical knowledge into all aspects of instruction, but we are to model and teach how to develop an intimate relationship with Jesus Christ and live accordingly."
        }
      ],
      "5": [
        {
          "name": "How to Deal with Racism and Prejudice in a Divided Nation",
          "location": "Worship Center",
          "speaker": "Ken Ham",
          "description":
            "So-called racial issues continue to heat up in America. Our culture needs the answers from God’s Word. Understanding what happened at the Tower of Babel is key to understanding the origin of nations, \"races,\" and prejudice. Ken shares Charles Darwin’s destructive ideas about skin color, facial features, etc. and on the lighter side, a comical perspective on poodles to explain natural selection and speciation."
        },
        {
          "name": "Training Teens to Take The Initiative",
          "location": "Gym",
          "speaker": "Dr. Steve Scheibner",
          "description":
            "Want to transition your young adults from simple obedience to mature responsibility? Dr. Scheibner shares the important phases teens need to learn to take responsibility for their lives. Watch your kids move from childish irresponsibility to becoming young adults who embrace ownership and initiative as they move up the \"Responsibility Tree.\""
        },
        {
          "name": "Help for Mompreneurs",
          "location": "Chapel",
          "speaker": "Connie Albers",
          "description":
            "The rise of Mom-preneurs exposes a need for moms to find balance betweenhomeschooling, career, and family while generatingincome. There are effective ways to delegate, set realistic goals, and seek work to fit a homeschooling lifestyle. Glean insights from a mom who has lost the battle many times, but her resilient spirit and desire to finish well can help you in your journey."
        },
        {
          "name": "Teach from a Flowing Stream, Not a Stagnant Pool",
          "location": "Red 7&8",
          "speaker": "Sonya Shafer",
          "description":
            "A drink from a vibrant, flowing stream is much more refreshing than one from a scummy, stagnant pool! Sonya encourages you to breathe vivacity back into your personal life—for your children’s benefit as well as your own. Discover a practical flexible way to rejuvenate your weekly schedule to help you embrace living, not settle for surviving."
        },
        {
          "name": "Home Based Business Considerations",
          "location": "Student Room",
          "speaker": "Allen Blain",
          "description":
            "In part two of the Why a Home-Based Business workshop, Allan shareshow to better evaluate types of businesses to find the right fit for a family. Learn about entrepreneurial mindset, product/service evaluation, God’s calling, the Harvard Business Law of an expanding market, passive income and leverage, family strengths, and mentors."
        },
        {
          "name":
            "Standing on the Solid Rock: How to Radically Transform Your Family Through Family Bible Study",
          "location": "Third Floor Lobby",
          "speaker": "Jonathan Brush",
          "description":
            "Faithfully having a time for daily family Bible study and worship transforms families, supercharges faith, and changes lives. Planning and leading doesn’t require any specialized training and yields benefits you can’t imagine. Jonathan shares about how his life, and the life of his family, has been transformed by this simple discipline. Leave equipped to change your family!"
        },
        {
          "name": "When Bible History and World History Meet Face to Face",
          "location": "Lobby Room North",
          "speaker": "Linda Hobar",
          "description":
            "Looking for inspiration in your study of ancient times? With Linda, discover what happens when Bible and world history meet face to face—literally! With a look at Daniel and Belshazzar, Esther and Xerxes, Jesus and Pilate, and more, see Bible characters and world history figures “meet” on one seamless thought-provoking timeline. Through stories and activities for all ages, let His story be revealed."
        },
        {
          "name": "Building A Good Conscience in Your Child",
          "location": "Lobby Room South",
          "speaker": "Dennis Gundersen",
          "description":
            "\"A good conscience\" is vital for children to form in their youth! When parents strengthen the conscience, a child can grow into an adult of strong convictions and righteous choices, even when parents are not present. Let’s make one of the goals of our instruction \"a good conscience\" (1 Timothy 1:5) and plan to achieve it! Dennis shares a practicalway to get started."
        },
        {
          "name": "Biblical Worldview & Culture: An Amazing Story",
          "location": "Green 7",
          "speaker": "Daniel Smithwick",
          "description":
            "A history \"fly over\" from creation to today helps us gain a deeper understanding of the providence of God in the affairs of men and nations. Twelve key events, occurring at 500-year intervals over the past 10,000 years, show the amazing story of how God advances his purposes for the Kingdom of Christ through key individuals acting in his timing. Learn how important the sphere of education is in our time."
        },
        {
          "name": "The Toddler Toolbox",
          "location": "Red 9",
          "speaker": "Megan Scheibner",
          "description":
            "Are the \"Terrible Twos\" eating your lunch? Need help managing your homeschool day with toddlers in the house? Megan draws on her many years of homeschooling experience with eight toddlers in tow to help you craft a plan for success. This workshop is intensely practical and will help you transform the Terrible Twos into the Terrific Twos!"
        },
        {
          "name": "Phonemic Awareness - The Missing Ingredient in Reading",
          "location": "Red 5",
          "speaker": "Faith Berens",
          "description":
            "Phonemic awareness could be why a child struggles with beginning reading instruction or has “sloppy speech” or doesn’t seem to “hear” things correctly. Find out more about these skills and how they (or a lack thereof) impact a child’s ability to become a proficient reader. Receive an assessment to use at home, “play” with phonemic awareness, plus more on these important, foundational skills."
        },
        {
          "name": "Evangelizing in Perilous Times",
          "location": "Green 4",
          "speaker": "Eric Barger",
          "description":
            "Free speech is under assault and our politically correct culture demands no dissent. The Bible and Christianity are increasingly viewed as \"hate speech.\" Persecution isn’t coming. IT’S HERE! Our mandate to \"go into all the world and preach the gospel\" hasn't changed, so in view of God's prophetic Word, thoughtful Christians will recognize the times and know how to respond in these last days."
        },
        {
          "name": "Christian Heritage Chorale #2",
          "location": "Chorale Room",
          "speaker": "Neil Craig",
          "description": ""
        }
      ],
      "6": [
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        }
      ],
      "7": [
        {
          "name": "Reform the Family . . . The Foundation of the Kingdom",
          "location": "Worship Center",
          "speaker": "Dr. Carlton McLeod",
          "description":
            "“The family—the much maligned, attacked, misunderstood, vilified, and thought to be irrelevant biblical family.” —Dr. Carlton McLeod, The Playbook. Just a brief look at our culture reveals the breakdown of the family and the consequences of compromising this holy institution. Find out more about God’s vision for the family, the need for family reformation, and the family’s impact on the Kingdom of God."
        }
      ],
      "8": [
        {
          "name": "Concessions",
          "location": null,
          "speaker": null,
          "description":
            "K.C Deez BBQ - Front Driveway \nWich Came First - Front Driveway \nSugar & Spice - Front Driveway \nCH Healthy Eats & Treats - Fellowship Park"
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        },
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        }
      ],
      "9": [
        {
          "name": "Mini Concert Performed by Homeschooled Students",
          "location": "Worship Center",
          "speaker": "",
          "description": ""
        },
        {
          "name": "Living on Borrowed Time - The Nine Practices of The Proactive Parent",
          "location": "Worship Center",
          "speaker": "Dr. Steve Scheibner",
          "description":
            "Dr. Scheibner was originally scheduled to be co-pilot on the first flight hijacked on Sept. 11th, 2001. Now, he tells a deeply moving story of God's providence and how he teaches parents to parent with purpose and urgency. He shares the Nine Practices of the Proactive Parent to give parents both tools and hope, to build a Christ-centered character-driven home environment."
        }
      ]
    }
  },
  "saturday": {
    "timeSlots": [
      {
        "id": 0,
        "name": "Registration",
        "startTime": "8:00AM",
        "endTime": "9:00AM",
        "duration": 60
      },
      {
        "id": 1,
        "name": "Keynote",
        "startTime": "9:00AM",
        "endTime": "10:15AM",
        "duration": 75
      },
      {
        "id": 2,
        "name": "Break",
        "startTime": "10:15AM",
        "endTime": "10:45AM",
        "duration": 30
      },
      {
        "id": 3,
        "name": "Workshop C",
        "startTime": "10:45AM",
        "endTime": "11:45AM",
        "duration": 60
      },
      {
        "id": 4,
        "name": "Lunch",
        "startTime": "11:45AM",
        "endTime": "1:00PM",
        "duration": 75
      },
      {
        "id": 5,
        "name": "Workshop D",
        "startTime": "1:00PM",
        "endTime": "2:00PM",
        "duration": 60
      },
      {
        "id": 6,
        "name": "Break",
        "startTime": "2:00PM",
        "endTime": "2:30PM",
        "duration": 30
      },
      {
        "id": 7,
        "name": "Workshop E",
        "startTime": "2:30PM",
        "endTime": "3:30PM",
        "duration": 60
      },
      {
        "id": 8,
        "name": "Break",
        "startTime": "3:30PM",
        "endTime": "4:15PM",
        "duration": 45
      },
      {
        "id": 9,
        "name": "Keynote",
        "startTime": "4:15PM",
        "endTime": "5:55PM",
        "duration": 100
      },
      {
        "id": 10,
        "name": "End of Conference",
        "startTime": "5:55PM",
        "endTime": "6:30PM",
        "duration": 35
      }
    ],
    "activities": {
      "0": [
        {
          "name": "Registration",
          "location": "Registration Table",
          "speaker": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        }
      ],
      "1": [
        {
          "name": "America and the Great Divide: It's a Full-On War",
          "location": "Worship Center",
          "speaker": "Ken Ham",
          "description":
            "Most evangelistic programs today (and most missionaries and evangelists) do not see Genesis as a key part of reaching people with the gospel. The history in Genesis (e.g. the origin of sin) is foundational to a full understanding of the gospel message. Realizing how culture now thinks (and has changed its thinking) in relation to earth history, is a key to approaching people and presenting the gospel!"
        }
      ],
      "2": [
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        }
      ],
      "3": [
        {
          "name": "The Biblical foundation for Christian education—How to Raise Godly Offspring",
          "location": "Worship Center",
          "speaker": "Ken Ham",
          "description":
            "Ken shares from his childhood to show parents the importance of a biblical foundation to training children. What does the Bible say (not your opinion) on how to bring up, train, discipline, and educate children? What should educational priorities be? Come be inspired and equipped with answers as you lead your family in the truth!"
        },
        {
          "name": "The Importance of a Biblical Marriage",
          "location": "Gym",
          "speaker": "Dr. Carlton McLeod",
          "description":
            "When husband and wife suffer in their relationship, it affects an entire home. It makes discipleship more difficult and spiritually weakens the home. What is the purpose of family? Dr. McLeod shares the value of cultivating a strong marriage and the greater goal of leading our children to Christ."
        },
        {
          "name": "Starving the Fear",
          "location": "Chapel",
          "speaker": "Connie Albers",
          "description":
            "I can’t do this! How can I teach my child when I don’t know Phonics or Physics? Has this thought run through your mind? Connie knows all too well the anxiety surrounding homeschooling. After twenty-one years of teaching her five children, she proclaims you don’t need a degree; you need determination and discernment, and consistent devotions. Find out three truths tostarve the fears and finish well"
        },
        {
          "name": "Fine Arts the Charlotte Mason Way",
          "location": "Red 7&8",
          "speaker": "Sonya Shafer",
          "description":
            "You don’t have to have a music degree or be an art aficionado to teach fine arts to your children. In this hands-on presentation, you’ll discover an easy yet effective way to give your children music and art appreciation that will enrich their lives and yours! Sonya shares practical ways to study music, composers, and artists. Learn a simple method that takes just ten minutes once a week!"
        },
        {
          "name": "The importance of Finding, Building, and Keeping Great Relationships",
          "location": "Student Room",
          "speaker": "Jonathan Brush",
          "description":
            "Your relationships with others determine your happiness, success, and well-being in life. They measure how you serve others, make a difference in the world, and influence your legacy. Knowing how to find, build, and keep them is very important! Learn how to choose critically when making them, prioritize them, and invest wisely to keep them."
        },
        {
          "name": "Training Young Men to be Gentlemen in a Feminist Culture",
          "location": "Third Floor Lobby",
          "speaker": "Dr. Steve Scheibner",
          "description":
            "Is acting like a gentleman an outdated and antiquated idea? Join Dr. Scheibner as he teaches how young men can be masculine in a culture seeking to squeeze them with a feminine mold. Becoming a gentleman starts at home, so come discover ways to cultivate masculinity without raising men who are brutes!"
        },
        {
          "name": "Mary and Martha Decide to Homeschool – a Workshop for Mary’s Only!",
          "location": "Lobby Room North",
          "speaker": "Linda Hober",
          "description":
            "If Mary and Martha were to homeschool, Martha might have her plans in place (but be frustrated), and Mary might be at the feet of Jesus (but behind schedule.) We relate to Mary and Martha, but this workshop is for those, like Mary, who love the Lord but need help and structure to homeschool. Linda, a self-proclaimed Mary, managed to homeschool for seventeen years, and still likes to talk about it!"
        },
        {
          "name": "Doing Family Worship without being a Bible Scholar",
          "location": "Lobby Room South",
          "speaker": "Dennis Gundersen",
          "description":
            "Many godly fathers are aware that, as family shepherd, they should build a habit of family worship–time in the Word of God and prayer together. But many feel inadequate. “How on earth do I lead my children into understanding God’s Word, when I’m just an ordinary Christian man?” Dennis presents simple, practical ideas any dad can put into practice.You can do this! You don’t have to be a Bible scholar."
        },
        {
          "name": "Want to Change the World? Living a Significant Life as a Daughter of the King",
          "location": "Green 7",
          "speaker": "Megan Craig",
          "description":
            "We all want to do something meaningful with our lives, and Secret Strategies of Success for the Socially Superior Single Young Woman are a dime a dozen.  But how does the Christian young lady sort through ideas and find her real place in changing the world for Jesus?  Megan shares encouragement from the Word, practical ideas, and joy for the journey to change the world – God’s way"
        },
        {
          "name": "Second Class Christians: The Scary Things God Calls You To",
          "location": "Red 9",
          "speaker": "Sydney Simao",
          "description":
            "Practicing evangelism and apologetics might seem only for those who: graduated from seminary, know flaws of every religion, and are slightly rude and argumentative. But, God still calls us, fearful “second-class” Christians, to preach the gospel and defend the faith. It’s not hard. You don’t have to know it all, be rude (the Bible commands you not to be), or win the argument-just be faithful to the gospel."
        },
        {
          "name":
            "Life on the Homeschool High Wire - Balancing Life and Lesson Plans: A Practical Survival Guide",
          "location": "Red 5",
          "speaker": "Faith Berens",
          "description":
            "Find encouraging ideas for how to make homeschooling fit in yourfamily’s unique situation and needs, as well as your teaching style, and your children’slearning styles. Faith shares suggestions for scheduling, time management, organization, andteaching multiple ages of children"
        },
        {
          "name": "Homeschooling Biblically and Homeschooling Legally - Are They Compatible?",
          "location": "Green 4",
          "speaker": "Susan Bradrick",
          "description":
            "By God’s grace, Washington homeschoolers can confidently homeschool biblically and legally. But a clear understanding of God’s commands for training children, state homeschool law, and your parental rights is critical. Learn about the law’s annual Declaration of Intent and testing directives, enrollment options, pros and cons of \"government school at home programs,\" and more."
        },
        {
          "name": "Christian Heritage Chorale #3",
          "location": "Chorale Room",
          "speaker": "Neil Craig",
          "description": ""
        }
      ],
      "4": [
        {
          "name": "Concessions",
          "location": null,
          "speaker": null,
          "description":
            "K.C Deez BBQ - Front Driveway \nWich Came First - Front Driveway \nSugar & Spice - Front Driveway \nCH Healthy Eats & Treats - Fellowship Park"
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        },
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        },
        {
          "name":
            "Vendor Workshop: How Grandparents Can have Significant Influence on Their Grandchildren",
          "location": "Chapel",
          "speaker": "Ron & Carolyn Hainline; Michael & Susan Bradrick",
          "description":
            "If you are looking for practical and creative ways to have a strong, significant, and godly influence on your grandchildren, this roundtable discussion is for you. Get new ideas from this panel of grandparents and share your own on how to effectively build a God-honoring bond with each one."
        },
        {
          "name": "Vendor Workshop: Q&A Session for Families with Special Needs Children",
          "location": "Red 7&8",
          "speaker": "Faith Berens",
          "description":
            "Meet with Faith in a small group and get your specific special-needs questions answered. She will answer parents’ personal questions and make suggestions geared towards individual children."
        },
        {
          "name": "Vendor Workshop: Serving Together as a Family",
          "location": "Student Room",
          "speaker": "Luk & Lisa Peterson, and children",
          "description":
            "Have you felt pulled in too many directions as a family? We have! Come and engage in a conversation regarding ways to minimize the strain and maximize the gain. We’ll discuss questions like: Is it important for a family to be serving together?  What does it mean to serve together? What can we do to get started? What are the benefits?"
        },
        {
          "name": "Vendor Workshop: The Benefits of a Classical Christian Education",
          "location": "Lobby Room North",
          "speaker": "Logos Online School",
          "description":
            "What does Jerusalem have to do with Athens? This is a perennial question as old as the church itself and just as relevant today. This workshop expounds the meaning and benefits of a Christian liberal arts education with an emphasis on the church’s historical position on the same, offering compelling support for why Christians should still study pagan literature today."
        },
        {
          "name": "Vendor Workshop: HSLDA Canada Update",
          "location": "Lobby Room South",
          "speaker": "HSLDA of Canada",
          "description":
            "Homeschool Legal Defence Association of Canada (HSLDA) is dedicated to supporting your family during your homeschool adventure. Whether you’re a homeschool veteran or just starting out, HSLDA has you covered. Our members have peace of mind knowing that we are always advocating on their behalf. HSLDA is the only Canadian organization with the expertise to provide legal representation in disputes with school boards and provincial agencies. From legal services, insurance coverage to homeschooling advice and resources, our experienced team has what your family needs. Don’t wait until something happens, become a member with the most trusted homeschool organization in Canada. HSLDA: the partner in your homeschool success."
        },
        {
          "name": "Vendor Workshop: Two Tools for Optimizing",
          "location": "Red 5",
          "speaker": "Optimizing Your Money",
          "description":
            "Have some fun watching on-screen calculators exploring the impact of taxation, inflation, and procrastination on your life-time financial picture. Come away with some ideas for reducing their impact and strengthening your financial future."
        },
        {
          "name": "Vendor Workshop: Creation Center Science Support",
          "location": "Green 4",
          "speaker": "Mt. St. Helens Creation Center",
          "description":
            "While some are expert scientists, not all homeschooling parents are comfortable with “high school age” science. The Mount St Helens Creation Center offers courses on physical science topics (chemistry and physics) for older teenagers. Our first two courses are on Oil and Metals."
        }
      ],
      "5": [
        {
          "name": "Pastors' and Church Leaders' Workshop: The Church in a Pickle",
          "location": "Worship Center",
          "speaker": "Dr. Carlton McLeod",
          "description":
            "A true look at the church in America finds that she is stuck between the world and God’s Word.Many churches have the best intentions to do the Lord’s work, but find themselves stuck. They are stuck between decades of following the world and the need to return to Scripture, and between man’s desire to hear pleasant words and a lessening influence on culture. All are welcome to this workshop for pastors, church leaders, and those who aspire to this level of leadership."
        },
        {
          "name": "Battling With Behavior",
          "location": "Gym",
          "speaker": "Dr. Steve Scheibner",
          "description":
            "Want your teen to take more initiative around the house? Want to reduce the “drama” level in the family? Want to get your pre-teens, teens, and young adults excited about character and healthy living? Dr. Scheibner reveals seven practical steps to raising the behavior bar in your home. These steps will begin the process of moving your young people from ordinary to extraordinary."
        },
        {
          "name": "Building Sibling Friendships",
          "location": "Chapel",
          "speaker": "Connie Albers",
          "description":
            "Will my children be friends when they grow-up? Connie wanted her five children to love each other, but then all they did was fight and argue! Sound familiar? Connie helped her children build lifelong friendships with each other during her homeschool journey and you can too. She believes homeschooling is the perfect environment for teaching children how to love each other."
        },
        {
          "name": "Why Should Anyone Believe the Bible?",
          "location": "Red 7&8",
          "speaker": "Dan Kreft",
          "description":
            "If someone were to ask you right now why you believe the Bible, would you have an answer? Would your answer be based upon facts or feelings? In this workshop, we'll look at the construction of the Bible, how we know that what we have today is what the original authors wrote, and consider the jaw-dropping, eye-popping odds that its prophecies about a Savior could all come true in one man."
        },
        {
          "name": "Biblical Worldview & Culture: A Troubling Story",
          "location": "Student Room",
          "speaker": "Daniel Smithwick",
          "description":
            "The deep meaning of \"worldview\" has key spheres in life: family, church, and state. Daniel reveals how our youth have been taken captive to an anti-biblical worldview by comparing the worldviews of biblical and secular / atheist scholars, to Christian youth. This troubling story must be understood by Christian educators today!"
        },
        {
          "name": "Boy Meets Girl. What Now?!",
          "location": "Third Floor Lobby",
          "speaker": "Daniel and Megan Craig",
          "description":
            "So you like this girl—or you think he’s cute. NOW WHAT? Marriage is God’s blessing, but the path to the altar often seems covered with broken glass–at least that’s what many couples’ bloody feet would indicate! Using God’s principles, Daniel and Megan share insights with peers and perspectives for parents based on their marriage and having grown up in the homeschool / courtship movement."
        },
        {
          "name": "What Tweens and Teens Should Know About WWI",
          "location": "Lobby Room North",
          "speaker": "Linda Hobar",
          "description":
            "From trenches and truces on the Western Front to famous flying aces in the sky, Linda walks you through a \"5-4-3-2-1 Countdown\" of what 'tweens and teens should know about World War I along with unforgettable stories to make it inspiring!"
        },
        {
          "name": "Homeschooling with a Broken Spirit",
          "location": "Lobby Room South",
          "speaker": "Dennis Gundersen",
          "description":
            "Homeschool moms have a busy life! The comprehensive, multi-faceted work can become overwhelming. If you, or a mother you know, feel depressed, this is the workshop for you. As Don Francisco sang, “It ain’t sin to get the blues,” but it’s not pleasant either. Dennis helps many a parent overcome depression and, just as importantly, find ways to still walk faithfully with God during that time of life."
        },
        {
          "name": "Surviving Suffering",
          "location": "Green 7",
          "speaker": "Julianne Primer",
          "description":
            "Julianne, a pastor's wife, mother of nine, cancer survivor, endurer of Lyme Disease, shares candidly about the journey from \"Why Me God?\" to \"My Soul Finds Rest In God Alone.\" Four truths will strengthen you to become deeper, softer, more confident in Christ,and freer than ever."
        },
        {
          "name": "When Life is Nothing Special: How to Serve God in the Ordinary",
          "location": "Red 9",
          "speaker": "Sydney Simao",
          "description":
            "God might call you to serve Him by demanding great sacrifices, leading through earth-shattering challenges, or bringing glorious triumphs. Many of us feel, by God’s grace, that we could dutifully trust Him through the seemingly impossible. But what if your call is to serve in plain, out-of-sight, seemingly easy ways? Sometimes facing the ordinary is a lot harder than changing the world."
        },
        {
          "name":
            "Tackling Tricky High School Issues: Practical Help and Guidance for Homeschooling High School Students with Special Needs",
          "location": "Red 5",
          "speaker": "Faith Berens",
          "description":
            "Challenged with home educating struggling or atypical learners in high school? Faith encourages you with alternative course work, specialized curricula, assistive technology, transcript options, graduation guidelines/high school programs, post-high school options, as well as offers tips to navigate the process of applying for testing accommodations in college entrance exams."
        },
        {
          "name": "The A to Z of a Character Healthy Homeschool",
          "location": "Green 4",
          "speaker": "Megan Scheibner",
          "description":
            "If we homeschool simply to achieve high academic marks, we are squandering the opportunity to influence our children for Christ. Character healthy leaders are those children who have learned to elevate virtues above feelings. If we spend our homeschooling hours simply on academics and activities, we may win the praise of man, but we risk losing the hearts of our children. In our few short years with our children we must focus on the first things first and character is always the first thing! In this conference, Megan, a homeschooling mother of eight, will challenge your homeschoolers to use every opportunity to teach their children to serve God by loving others and to love others by faithfully serving God."
        }
      ],
      "6": [
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        },
        {
          "name": "Silent Auction",
          "location": "Second Floor Hallway",
          "speaker": null
        }
      ],
      "7": [
        {
          "name": "2ML (Second Mile Leadership For Men)",
          "location": "Worship Center",
          "speaker": "Dr. Steve Scheibner",
          "description":
            "Second mile leaders are counter-intuitive servants of God who develop a consistent love of virtue, a disciplined approach to gratification, and a submissive love for the authority of God’s Word. Male leadership is essential to the success of marriages, families, the church, and society. Earn the right to be heard and more—powerful!"
        },
        {
          "name": "Critical Skills Your Child Needs to be Successful",
          "location": "Gym",
          "speaker": "Jonathan Brush",
          "description":
            "Academic knowledge is important, but does it prepare for success in future employment? Is your student becoming a collaborator, communicator, critical thinker, and creator? Are they developing media, information, technology, life,and career skills? Surveyed college professors and CEOs disagree on how prepared a graduate is for modern life. Learn how to plan for success… beyond the curriculum."
        },
        {
          "name": "Remaining Steadfast During High School",
          "location": "Chapel",
          "speaker": "Connie Albers",
          "description":
            "It’s hard to stay the course during the high school years. Everything is changing: the rules, the requirements, and the relationship. Your teen is changing too. So why is staying the course a crucial goal of your homeschooling journey, even though the rules aren’t working anymore? Well, teens need you to be a steady force in their life. This time can be the most rewarding of your parenting journey."
        },
        {
          "name": "Keep it Simple: How to Teach Your Whole Family Together",
          "location": "Red 7&8",
          "speaker": "Sonya Shafer",
          "description":
            "Save time and money by teaching most school subjects to all of your students together. Sonja shares strategies to lower your stress level, provide a well-rounded education, and help you build sweet memories. Learn how to do school subjects together and which subjects arebest done one-on-one. Take a sample schedule to get started. Teach your whole family together with Charlotte Mason methods!"
        },
        {
          "name": "Biblical Worldview & Culture: The Forgotten Story",
          "location": "Student Room",
          "speaker": "Daniel Smithwick",
          "description":
            "There is a \"worldview shift\" occurring in America over the past four hundred years. Understand this Colonial Education Era in America by studying the character of the people, how they determined what was real, how they knew what they knew, and what demonstrated a good life. This shift from a biblical-based to a secular-based education system is the Forgotten Story of today."
        },
        {
          "name": "Starting a Side Hustle, Growing a Family Enterprise",
          "location": "Third Floor Lobby",
          "speaker": "Larry Cormick",
          "description":
            "Christian families that start an entrepreneurial endeavor begin a better family legacy today than ever before. The availability of information in our highly technical age creates an incredible opportunity for new businesses. The perfect way to start that business and reach financial freedom is as a family!"
        },
        {
          "name": "To Grade or Not to Grade: A Practical Workshop on Grades in Homeschool",
          "location": "Lobby Room North",
          "speaker": "Linda Hobar",
          "description":
            "Because we are shaped by our personality types, the power of grades can motivate some and destroy others. Linda shares grading theories, as well as practical tips to make keeping grades simple. With Linda’s “real life” examples from the work of her own children, be encouraged—newbies and veterans alike!"
        },
        {
          "name": "A Hebrew Boy's Education in the Time of Christ",
          "location": "Lobby Room South",
          "speaker": "Dennis Gundersen",
          "description":
            "It’s hard for Westerners to understand how Hebrew families viewed the essentials of education. Consider the schooling the young Jesus of the Bible would have received. Take a journey back to Nazareth’s school and see unique perspectives and goals encouraged there. We can learn a lot from an ancient Hebrew schoolhouse!"
        },
        {
          "name": "Rock Identification Made Easy",
          "location": "Green 7",
          "speaker": "Patrick Nurre",
          "description":
            "What do you do with those rocks your kids are bringing home? You identify them! This workshop will give you a short primer in basic rock identification, with encouragement to not be afraid of a dirty subject."
        },
        {
          "name": "From Grumbling to Gratitude",
          "location": "Red 9",
          "speaker": "Naomi Gundersen",
          "description":
            "A joyful, gratitude-filled home with an absence of grumbling and discontentment can be cultivated and encouraged in any home! Children tend to pick up what we manifest the most. Naomi shares her heart about what it takes to shift from a mindset of a grumbling grater to a grateful spreader of joy in the family and beyond."
        },
        {
          "name": "Laying a Foundation for Reading Comprehension in the Preschool Years",
          "location": "Red 5",
          "speaker": "Faith Berens",
          "description":
            "Comprehension, the ultimate goal of reading instruction, involves various types of thinking and processing skills. Faith shares tips, techniques, and strategies that develop veryyoung children’s vocabulary. Good habits of mind lay a solid foundationfor comprehension with our wee ones from birth to five years old."
        },
        {
          "name": "The Disciple-Making Mom",
          "location": "Green 4",
          "speaker": "Megan Scheibner",
          "description":
            "More than feeding, dressing, and driving our kids to play-dates, being a mom means every day is an opportunity for teaching, training, and modeling Christlikeness. The Disciple-Making Mom needs tools to disciple her children in prayer, service, Bible study, Scripture memorization, and true fellowship. Be encouraged and strengthened, knowing that although discipling seems a huge task, God is on your side."
        },
        {
          "name": "Christian Heritage Chorale #4",
          "location": "Chorale Room",
          "speaker": "Neil Craig",
          "description": ""
        }
      ],
      "8": [
        {
          "name": "Vendor Hall",
          "location": "Vendor Hall",
          "speaker": null
        },
        {
          "name": "Auction Pick Up",
          "location": "Second Floor Hallway",
          "speaker": null
        },
        {
          "name": "Order CDs, DVDs, or MP3s",
          "location": "Audio Duplication",
          "speaker": null
        }
      ],
      "9": [
        {
          "name": "Battle for Our Children",
          "location": "Worship Center",
          "speaker": "Dr. Carlton McLeod",
          "description":
            "Are we fighting hard enough for our children? What happens to them as we raise them in the fear of the Lord? We know the statistics showing that 70-80% of children leave the faith by the time they reach college. Dr. McLeod encourages us in how and why we should fight even more for the next generation."
        }
      ],
      "10": [
        {
          "name": "End of Conference",
          "description": "Final opportunity to pick up CDs, DVDs, and MP3s. Doors close at 6:30 PM"
        }
      ]
    }
  }
}
